Repository: ankalago/frontend-edit-profile
Catalog: languages/fep-*.po
Languages: fi

source: Your Profile
fi: Profiili

source: Logout
fi: Kirjaudu ulos

source: Display login widget on sidebar
fi: Näytä kirjautumiswidgetti sivupalkissa

source: Title:
fi: Otsikko:

source: Show Register Link
fi: Näytä rekisteröintilinkki

source: Hide widget when user logged in
fi: Piilota widgetti kun käyttäjä on kirjautuneena

source: Name
fi: Nimi

source: Username
fi: Käyttäjänimi

source: Usernames cannot be changed.
fi: Käyttäjänimiä ei voi vaihtaa.

source: First Name
fi: Etunimi

source: Last Name
fi: Sukunimi

source: Nickname
fi: Nimimerkki

source: (required)
fi: (pakollinen)

source: Display to Public as
fi: Näytä nimi julkisilla sivuilla tässä muodossa:

source: Contact Info
fi: Yhteystiedot

source: E-mail
fi: Sähköpostiosoite

source: There is a pending change of your e-mail to <code>%1$s</code>. <a href="%2$s">Cancel</a>
fi: Täällä on odottava muutos sähköpostistasi osoitteeseen <code>%1$s</code>. <a href="%2$s">Peruuta</a>

source: Website
fi: Verkkosivu

source: About Yourself
fi: Tietoja itsestäsi

source: Biographical Info
fi: Lisää hieman elämäkerrallista tietoa.

source: Share a little biographical information to fill out your profile. This may be shown publicly.
fi: Kerro muutamalla sanalla itsestäsi. (Näkyy mahdollisesti muille)

source: New Password
fi: Uusi salasana

source: If you would like to change the password type a new one. Otherwise leave this blank.
fi: Jos haluat vaihtaa salasanasi, kirjoita uusi salasana. Muuten jätä tämä tyhjäksi.

source: Type your new password again.
fi: Kirjoita uusi salasanasi uudelleen.

source: Strength indicator
fi: Vahvuuden ilmaisin

source: The password should be at least seven characters long.
fi: Salasanan tulisi olla vähintään seitsemän merkkiä pitkä.

source: To make it stronger, use upper and lower case letters, numbers and symbols like ! " ? $ % ^ &amp; ).
fi: Tehdäksesi siitä vahvemman, käytä suuria ja pieniä kirjaimia, numeroita ja symboleita kuten ! " ? $ % ^ &amp; ja ).

source: Update Profile
fi: Päivitä profiilia

source: <strong>Success</strong>: Profile updated
fi: <strong>Onnistui</strong>: Profiilia päivitetty

source: <strong>ERROR</strong>: Empty username
fi: <strong>VIRHE</strong>: Tyhjä käyttäjänimi

source: <strong>ERROR</strong>: Empty password
fi: <strong>VIRHE</strong>: Tyhjä salasana

source: <strong>ERROR</strong>: Invalid username
fi: <strong>VIRHE</strong>: Virheellinen käyttäjänimi

source: <strong>ERROR</strong>: Incorrect password
fi: <strong>VIRHE</strong>: Virheellinen salasana

source: General Settings
fi: Yleiset asetukset

source: Show Biographical Info
fi: Näytä elämänkerrallisia tietoja

source: Show Password Indicator
fi: Näytä salasanan vahvuuden ilmaisin

source: Show Password Hint
fi: Näytä salasanavinkki

source: Custom Password Hint
fi: Kustomoitu salasanavihje

source: Show Login Form
fi: Näytä kirjautumislomake

source: Not Logged in Text
fi: Ei kirjautunut sisään-teksti

source: Login URL
fi: Kirjautumis URL

source: Logout URL
fi: Kirjaudu ulos URL

source: Lost Password URL
fi: Kadonnut salasana URL

source: Register URL
fi: Rekisteröidy URL

source: Disable Contact Methods
fi: Poista yhteydenottomenetelmät

source: Click to disable contact methods in profile page
fi: Klikkaa poistaaksesi käytöstä yhteydenottomenetelmät profiilisivulla

source: Save Changes
fi: Tallenna muutokset

source: Password
fi: Salasana

source: Remember me
fi: Muista minut

source: Logged me in
fi: Kirjautunut käyttäjänä

source: Don't have account? Register.
fi: Ei ole tiliä? Rekisteröidy.
